app/controllers/posts_controller.rb

  def index
    # Gather all post data
    posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    # Create and save new post from data received from the client
    if !params[:new_post].blank?
    new_post = Post.new
    new_post.title = params[:new_post][:title][0...250] # Get only first 250 characters
    new_post.contents = params[:new_post][:contents]

      # Confirm post is valid and save or return HTTP error
      if new_post.valid?
        new_post.save!
      else
        render "public/422", :status => 422
        return
      end

      # Respond with newly created post in json format
      respond_with(new_post) do |format|
        format.json { render :json => new_post.as_json }
      end
    elsif !params[:edit_post].blank?
      # Edit and save new post from data received from the client
      edit_post = Post.find_by_id(params[:edit_post][:id])
      edit_post.title = params[:edit_post][:title][0...250] # Get only first 250 characters
      edit_post.contents = params[:edit_post][:contents]

      # Confirm post is valid and save or return HTTP error
      if edit_post.valid?
        edit_post.save!
---
INSERT INTO "posts" ("contents", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT 1
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = 10  [["title", "Far far away!!!!!!!!"], ["updated_at", Thu, 09 Jan 2014 15:05:18 UTC +00:00]]

      delete_post = Post.find_by_id(params[:delete_post][:id])
      # Confirm post is valid and save or return HTTP error
      if !delete_post.blank?
        delete_post.destroy!
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 5]]